Tekla.Structures.Model.Position.PlaneEnum
The position in the plane sense.

Tekla.Structures.Model.Position.PlaneEnum.MIDDLE
The middle option.

Tekla.Structures.Model.Position.PlaneEnum.LEFT
The left option.

Tekla.Structures.Model.Position.PlaneEnum.RIGHT
The right option.